## Data Saturation
Developed by Ajmal Quraishi\
Date: 22-oct-2023\
E-mail: ajmalquraishi98@gmail.com

In [3]:
import pandas as pd
import seaborn as sns

titanic = sns.load_dataset('titanic')
df = titanic
df.dtypes[df.dtypes == 'object']
titanic[['pclass', 'survived', 'sex', 'age', 'sibsp', 'parch', 'embarked']]

     pclass  survived     sex   age  sibsp  parch embarked
0         3         0    male  22.0      1      0        S
1         1         1  female  38.0      1      0        C
2         3         1  female  26.0      0      0        S
3         1         1  female  35.0      1      0        S
4         3         0    male  35.0      0      0        S
..      ...       ...     ...   ...    ...    ...      ...
886       2         0    male  27.0      0      0        S
887       1         1  female  19.0      0      0        S
888       3         0  female   NaN      1      2        S
889       1         1    male  26.0      0      0        C
890       3         0    male  32.0      0      0        Q

[891 rows x 7 columns]

In [12]:
titanic[titanic.dtypes[df.dtypes=='float'].index]

      age     fare
0    22.0   7.2500
1    38.0  71.2833
2    26.0   7.9250
3    35.0  53.1000
4    35.0   8.0500
..    ...      ...
886  27.0  13.0000
887  19.0  30.0000
888   NaN  23.4500
889  26.0  30.0000
890  32.0   7.7500

[891 rows x 2 columns]

In [31]:
titanic[['sex']][0:17:7]

   sex
0    0
7    0
14   0

In [33]:
titanic[['age', 'sibsp', 'parch']][0:17:2]

     age  sibsp  parch
0   22.0      1      0
2   26.0      0      0
4   35.0      0      0
6   54.0      0      0
8   27.0      0      2
10   4.0      1      1
12  20.0      0      0
14  14.0      0      0
16   2.0      4      1